# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [23,27, 37,58, 81,82]  # P4/16
  - [81,82,  135,169, 344,319]  # P5/32

# YOLOv4-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 2]],
   [-1, 1, Conv, [64, 3, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 1, Conv, [512, 3, 1]],
  ]

# YOLOv4-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1]], #6
   [-1, 1, Conv, [512, 3, 1]], #7

   [6, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],
   [-1, 1, Conv, [256, 3, 1]], #11

   [[11, 7], 1, Detect, [nc, anchors]]
  ]
