# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
  ]

# YOLOv5 v6.0 head
head:
  [
    [3, 1, Conv, [1024, 1, 1]], # 8-P3/8
    [5, 1, Conv, [1024, 1, 1]], # 9-P4/16
    [7, 1, Conv, [1024, 1, 1]], # 10-P5/32
    [-1, 1, Conv, [1024, 1, 1]],
    [-1, 1, nn.MaxPool2d, [2, 2, 0]], #12-P6/64

    #NAS-FPN
    [[12,9], 1, MergingCell, [1, "GP"]], #13-P4_1/16
    [[13,9], 1, MergingCell, [1, "SUM"]], #14-P4_2/16
    [[14,8], 1, MergingCell, [1, "SUM"]], #15-P3/8
    [[15,14], 1, MergingCell, [1, "SUM"]], #16-P4/16
    [[16,15], 1, MergingCell, [4, "GP", False]], #17-P5_tmp/32
    [[10,17], 1, MergingCell, [1, "SUM"]], #18-P5/32

    [[15,16,18], 1, Detect, [nc, anchors]] #Detect(P3,P4,P5)
  ]
