{nc: 80, depth_multiple: 0.33, width_multiple: 0.5, anchors: [[10, 13, 16, 30, 33,
      23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]], backbone: [
    [-1, 1, Conv, [64, 6, 2, 2]], [-1, 1, Conv, [128, 3, 2]], [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], [-1, 6, C3, [256]], [-1, 1, Conv, [512, 3, 2]], [
      -1, 9, C3, [512]], [-1, 1, Conv, [1024, 3, 2]], [-1, 3, C3, [1024]], [-1, 1,
      SPPF, [1024, 5]]], head: [[[9, 3], 1, ConcatCell, [256, 1.0, -1, 128, BottleneckCSP2]],
    [[10, 5], 1, ConcatCell, [512, 2.0, 256, 512, C3]], [[10, 5], 1, ConcatCell, [
        256, 2.0, 256, -1, BottleneckCSP]], [[9, 12], 1, ConcatCell, [128, 0.5, 512,
        128, BottleneckCSP2]], [[10, 3], 1, ConcatCell, [256, 2.0, 512, 256, C3]],
    [[11, 5], 1, ConcatCell, [128, 2.0, 128, -1, C3SPP]], [[10, 14, 15], 1, Detect,
      [nc, anchors]]], ch: 3}
