# YOLOv5  by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
- [10, 13, 16, 30, 33, 23] # P3/8
- [30, 61, 62, 45, 59, 119] # P4/16
- [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone: [[-1, 1, Conv, [64, 6, 2, 2]],
                                  # 0-P1/2
 [-1, 1, Conv, [128, 3, 2]],
                                # 1-P2/4
 [-1, 3, C3, [128]], [-1, 1, Conv, [256, 3, 2]],
                                # 3-P3/8
 [-1, 6, C3, [256]], [-1, 1, Conv, [512, 3, 2]],
                                # 5-P4/16
 [-1, 9, C3, [512]], [-1, 1, Conv, [1024, 3, 2]],
                                 # 7-P5/32
 [-1, 3, C3, [1024]], [-1, 1, SPPF, [1024, 5]]]

# YOLOv5 v6.0 head
head:
- - - 9
    - 5
  - 1
  - ConcatCell
  - - 128
    - 1.0
    - 128
    - 512
- - - 3
    - 5
  - 1
  - ConcatCell
  - - 128
    - 1.0
    - 128
    - 256
- - - 10
    - 3
  - 1
  - ConcatCell
  - - 128
    - 2.0
    - -1
    - 128
- - - 12
    - 3
  - 1
  - ConcatCell
  - - 256
    - 1.0
    - 256
    - 128
- - - 13
    - 10
  - 1
  - ConcatCell
  - - 128
    - 2.0
    - 256
    - 512
- - - 14
    - 5
  - 1
  - ConcatCell
  - - 512
    - 0.5
    - 256
    - 512
- - - 15
    - 12
    - 14
  - 1
  - Detect
  - - nc
    - anchors
